Repository: x211321/Acer-RGB-Keyboard-Config-Linux
Catalog: assets/locale/*/LC_MESSAGES/rgb_config_acer_gkbbl_0.po
Languages: de

source: Extend max speed
de: Maximale Geschwindigkeit erhöhen

source: Close
de: Schließen

source: RGB Config
de: RGB Konfiguration

source: RGB Config (acer-gkbbl-0)
de: RGB Konfiguration (acer-gkbbl-0)

source: Install instructions:
de: Installationsanleitung:

source: About RGB Config (acer-gkbbl-0)
de: Über RGB Konfiguration (acer-gkbbl-0)

source: Profiles listed
de: Profile gelistet

source: Profile loaded:
de: Profil geladen:

source: Profile deleted:
de: Profil gelöscht:

source: Profile name
de: Profilname

source: Save profile
de: Profil speichern

source: Profile saved:
de: Profil gespeichert:

source: Settings applied
de: Einstellungen angewandt

source: Acer RGB Settings
de: Acer RGB Einstellungen

source: ERROR: RGB device %s not found
de: FEHLER: RGB Gerät %s nicht gefunden

source: Static RGB device %s detected
de: Statisches RGB Gerät %s erkannt

source: ERROR: Static RGB device %s not found
de: FEHLER: Statisches RGB Gerät %s nicht gefunden

source: RGB Device %s not available
de: RGB Gerät %s nicht verfügbar

source: Payload written to %s
de: Payload nach %s geschrieben

source: RGB device %s detected
de: RGB Gerät %s erkannt

source: Settings
de: Einstellungen

source: RGB Mode
de: RGB Modus

source: Brightness
de: Helligkeit

source: Speed
de: Geschwindigkeit

source: Direction
de: Richtung

source: Left to Right
de: Links nach Rechts

source: Right to Left
de: Rechts nach Links

source: Color section 1
de: Farbe für Abschnitt 1

source: Color section 2
de: Farbe für Abschnitt 2

source: Color section 3
de: Farbe für Abschnitt 3

source: Color section 4
de: Farbe für Abschnitt 4

source: Save as profile
de: Als Profil speichern

source: Apply
de: Anwenden

source: Profiles
de: Profile

source: Refresh
de: Aktualisieren

source: Delete
de: Löschen

source: Load
de: Laden

source: Open profile folder
de: Profilordner öffnen

source: Quit
de: Beenden

source: File
de: Datei

source: Show tray icon
de: Tray icon anzeigen

source: Start minimized
de: Minimiert starten

source: Close to tray
de: Beim schließen in System Tray minimieren

source: Apply [ACTIVE] on startup
de: [ACTIVE] Profil beim Programmstart anwenden

source: Options
de: Optionen

source: Show log
de: Log anzeigen

source: Show profiles
de: Profile anzeigen

source: Show preview
de: Vorschau anzeigen

source: View
de: Anzeige

source: About RGB Config (acer-gkbbl-0)
de: Über RGB Config (acer-gkbbl-0)

source: About
de: Über

source: MIT License Copyright 2022 x211321 Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do , subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
de: MIT Lizenz Copyright 2022 x211321 Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do , subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

source: RGB Config (acer-gkbbl-0) on GitHub
de: RGB Config (acer-gkbbl-0) auf GitHub

source: wxPython not available Please install wxPython via your distributions package manager or python3 pip. e.g. apt install python3-wxgtk4.0 Visit https://wxpython.org/ for more information
de: wxPython ist nicht verfügbar wxPython kann über die Paketverwaltung Ihres Systems oder via python3 pip installiert werden. z.B. apt install python3-wxgtk4.0 https://wxpython.org/ für weitere informationen

source: Error
de: Fehler

source: Delete "%s"?
de: "%s" löschen?

source: Delete profile
de: Profil löschen

source: Language
de: Sprache

source: The application must be restartet to apply the language change. Do you want to restart now?
de: Die Anwendung muss neu gestartet werden um die Sprache zu ändern. Soll jetzt neu gestartet werden?

source: Change language
de: Sprache ändern

source: Tray icon style
de: Tray icon Stil

source: The RGB device is not available. RGB Config (acer-gkbbl-0) can try to install the required kernel module for you (requires root privileges). Do you want to continue?
de: Das RGB-Gerät ist nicht verfügbar RGB Config (acer-gkbbl-0) kann versuchen das benötigte Kernel Modul zu installieren (erfordert Root Rechte). Modul installieren?

source: RGB device not available
de: RGB-Gerät nicht verfügbar

source: The kernel module will not be automatically installed. Please check https://github.com/JafarAkhondali/acer-predator-turbo-and-rgb-keyboard-linux-module for manual installation instructions
de: Das Kernel-Modul wird nicht automatisch installiert. Siehe https://github.com/JafarAkhondali/acer-predator-turbo-and-rgb-keyboard-linux-module für Installationsanweisungen

source: Offical Acer software only takes speed values between 0 and 9. In theory the acer-gkbbl-0 character device accepts speed values between 0 and 255. Values above the standard limit of 9 might yield undesired results. It is advised to proceed with caution. Are you sure you want to extend the speed limit?
de: Offizielle Acer Software erlaubt Geschwindigkeiten zwischen 0 und 9. Der acer-gkbbl-0 Kernel Treiber akzeptiert jedoch Werte zwischen 0 und 255. Werte über 9 werden nicht offiziell unterstützt und können zu unerwünschten Ergebnissen führen\n" Diese Funktion sollte mit Bedacht verwendet werden. Soll die maximale Geschwindigkeit erhöht werden?

source: Install kernel module
de: Kernel-Modul installieren

source: RGB Config (acer-gkbbl-0) will perform the steps listed below.
de: RGB Config (acer-gkbbl-0) wird folgende Schritte durchführen.

source: Step 1 - Check system requirements
de: Schritt 1 - Systemanforderungen überprüfen

source: Manufacturer
de: Hersteller

source: Device
de: Gerät

source: Step 2 - Download installation files
de: Schritt 2 - Installationsdaten herunterladen

source: Kernel module Github
de: Kernel-Modul Github

source: [source]
de: [Quelle]

source: Step 3 - Extract installation files
de: Schritt 3 - Installationsdaten entpacken

source: Step 4 - Run install script
de: Schritt 4 - Installations-Script ausführen

source: Step 5 - Verify installation
de: Installation überprüfen

source: RGB device
de: RGB-Gerät

source: Static RGB device
de: Statisches RGB-Gerät

source: Exit
de: Schließen

source: Begin installation
de: Installation starten

source: Beginning installation process
de: Starte Installationsprozess

source: Step 1 - Check system requirements
de: Schritt 1 - Systemanforderungen überprüfen

source: Step 2 - Download installation files
de: Schritt 2 - Installationsdaten herunterladen

source: Installation files could not be downloaded. Installation aborted.
de: Installationsdaten konnten nicht heruntergeladen werden. Installation abgebrochen.

source: Download failed
de: Download fehlgeschlagen

source: Step 3 - Extract installation files
de: Schritt 3 - Installationsdaten entpacken

source: Installation files could not be extracted. Installation aborted.
de: Installationsdaten konnten nicht entpackt werden. Installation abgebrochen.

source: Extract failed
de: Entpacken fehlgeschlagen

source: Step 4 - Install installation files
de: Schritt 4 - Installationsdaten installieren

source: The install script could not be executed. Installation aborted.
de: Das Installations-Script konnte nicht ausgeführt werden. Installation abgebrochen.

source: Install failed
de: Installation fehlgeschlagen

source: Step 5 - Verify installation
de: Schritt 5 - Installation überprüfen

source: One or more RGB devices unavailable. Either the installation has failed or the kernel module could not be loaded. Sometime the kernel module cannot be loaded until the device was restarted.
de: Mindestens ein RGB-Gerät ist nicht verfügbar. Entweder ist die Installation fehlgeschlagen oder das Kernel-Modul konnte nicht geladen werden. Gelegentlich kann das Kernel-Modul erst nach einem Neustart geladen werden.

source: Verification failed
de: Überprüfung fehlgeschlagen

source: Authentication required. RGB Config (acer-gkbbl-0) must perform an action that requires root privileges.
de: Authentifizierung erforderlich. RGB Config (acer-gkbbl-0) muss eine Aktion durchführen die Root-Rechte benötigt.

source: Authentication required
de: Authentifizierung erforderlich

source: Manufacturers other than Acer are most likely not compatible with this module
de: Andere Hersteller als Acer sind vermutlich mit diesem Modul nicht kompatibel

source: Unknown
de: Unbekannt

source: The device manufacturer could not be detected
de: Der Gerätehersteller konnte nicht ermittelt werden

source: The compatibility list could not be retrieved
de: Die Kompatibilitätsliste konnte nicht abgerufen werden

source: The device model could not be detected
de: Das Gerätemodell konnte nicht ermittelt werden

source: The model number does not appear on the list of supported devices
de: Das Gerät steht nicht auf der Liste unterstützter Geräte

source: Disabled
de: Deaktiviert

source: Enabled
de: Aktiviert

source: Secure boot should be disabled. The module will probably not work with secure boot enabled
de: Secure boot muss deaktiviert sein. Das Modul funktioniert wahrscheinlich nicht wenn Secure boot aktiv ist

source: Secure boot state could not be detected
de: Secure boot Status konnte nicht ermittelt werden

source: The init system seems to be unsupported
de: Das Init-System scheint nicht unterstützt zu werden

source: No service will be installed, the module will only work until shutdown
de: Es wird kein Dienst installiert, das Modul funktioniert nur bis zum Herunterfahren

source: The init system could not be detected
de: Das Init-System konnte nicht ermittelt werden

source: System might not meet all requirements.
de: Das System entspricht nicht allen Anforderungen

source: Warnings ---------
de: Warnungen ---------

source: Potential errors ---------
de: Mögliche Fehler ---------

source: You can still try to continue the installation but the module might not work with your setup.
de: Die Installation kann fortgeführt werden aber das Modul wird eventuell nicht funktionieren.

source: System check
de: Systemüberprüfung

source: Downloading...
de: Herunterladen...

source: Removing old file:
de: Entferne alte Daten:

source: Downloading installation file:
de: Lade Installationsdaten herunter:

source: Download successful file:
de: Download erfolgreich, Datei:

source: Success
de: Erfolgreich

source: Failed
de: Fehlgeschlagen

source: Extracting...
de: Entpacke...

source: Removing old installation files:
de: Entferne alte Installationsdaten:

source: Extracting installation files:
de: Entpacke Installationsdaten:

source: Installation files extracted to:
de: Installationsdaten entpackt nach:

source: Installing...
de: Installiere...

source: Setting execute permissions on install files
de: Setze Ausführberechtigungen für Installationsdaten

source: Running install script:
de: Führe Installations-Script aus:

source: Install successful:
de: Installation erfolgreich:

source: Available
de: Verfügbar

source: Unavailable
de: Nicht verfügbar
